ambiguous_custom_block_signature=Los nombres de los bloques propios no son \u00FAnicos. Solo se pueden distinguir dos bloques propios con el mismo nombre si tienen un n\u00FAmero u orden de par\u00E1metros diferente. Trata de que los nombres de los bloques propios sean siempre \u00FAnicos.
ambiguous_parameter_name_unused=Scratch permite m\u00FAltiples par\u00E1metros con el mismo nombre en un bloque propio. Sin embargo, luego no puede distinguir entre estos par\u00E1metros, lo que causa problemas en tu programa. Utiliza siempre par\u00E1metros con nombres \u00FAnicos.
ambiguous_parameter_name_used=Scratch permite m\u00FAltiples par\u00E1metros con el mismo nombre en un bloque propio. Sin embargo, luego no puede distinguir entre estos par\u00E1metros, lo que causa problemas en tu programa. Utiliza siempre par\u00E1metros con nombres \u00FAnicos.
backdrop_switch=Very nice! You use the backdrop change event to start different scipts. That allows you to perform different actions depending on the backdrop of the game.
blocking_if_else=Est\u00E1s utilizando los bloques [sbi]detener [todos v][/sbi] o [sbi]detener [este programa v][/sbi] en la rama [IF] (si) y [ELSE] (entonces) de este bloque. Si lo haces as\u00ED, el script terminar\u00E1 siempre y los bloques despu\u00E9s de [sbi]si < > entonces[/sbi] nunca se ejecutan. Intenta utilizar mejor la instrucci\u00F3n de parada solo en una rama o elimina los bloques despu\u00E9s de [sbi]si < > entonces[/sbi].
blocking_if_else_inside_loop=Est\u00E1s utilizando los bloques [sbi]detener [todos v][/sbi] o [sbi]detener [este programa v][/sbi] en la rama [IF] (si) y [ELSE] (entonces) de este bloque. De esta manera, el script terminar\u00E1 siempre y las instrucciones fuera de [sbi]si < > entonces[/sbi] nunca se ejecutar\u00E1n. Intenta usar el comando de parada solo en una rama o elimina el bucle.
boolean_expression=Good! You use boolean expressions in your program.
busy_waiting_all=En tu secuencia de instrucciones, est\u00E1s comprobando constantemente una condici\u00F3n, solo para detener todo una vez se cumpla. Utiliza mejor el bloque [sbi]espera hasta < >[/sbi] en lugar de la combinaci\u00F3n forever (por siempre) e if (si) para finalizar tu script cuando se cumpla la condici\u00F3n.
busy_waiting_clone=En tu secuencia de instrucciones, est\u00E1s comprobando constantemente una condici\u00F3n, solo para eliminar el clon una vez que se cumpla la condici\u00F3n. Mejor utiliza el bloque [sbi]espera hasta que < >[/sbi] en lugar de utilizar una combinaci\u00F3n [sbi]por siempre[/sbi] e [sbi]si < > entonces[/sbi] para finalizar tu script cuando se cumpla la condici\u00F3n.
busy_waiting_script=En tu script, est\u00E1s comprobando constantemente una condici\u00F3n, solo para detener el script una vez que se cumpla. Utiliza mejor el bloque [sbi]espera hasta que < >[/sbi] en lugar de la combinaci\u00F3n [sbi]por siempre[/sbi] e [sbi]si < > entonces[/sbi] para finalizar tu script cuando se cumpla la condici\u00F3n.
call_without_definition=Si usaste un bloque propio en tu programa y lo eliminaste, todav\u00EDa puede haber fragmentos de c\u00F3digo que se refieran a este bloque propio. Aseg\u00FArate de eliminar todas las instancias en las que se utiliz\u00F3 el bloque propio eliminado.
clone_type_1=Hay insturcciones id\u00E9nticas en varios guiones. Un bloque propio podr\u00EDa simplificar tu c\u00F3digo.
clone_type_2=Hay instrucciones similares en varios scripts, que solo difieren en los par\u00E1metros. Un bloque personalizado podr\u00EDa simplificar tu c\u00F3digo.
clone_type_3=Hay c\u00F3digo similar en varios scripts. Un bloque personalizado podr\u00EDa simplificar tu c\u00F3digo.
collision=Well done! Your sprite shows a certain behavior (e.g. changes its looks or moves) when it collides with or touches something.
comparing_literals_default_false=Est\u00E1s comparando dos valores que no cambian mientras se ejecuta tu programa. Tu bloque en forma de diamante siempre devolver\u00E1 [FALSE]. En consecuencia, tu c\u00F3digo entre corchetes horizontales %ALWAYSNEVER se ejecuta. Cambie la comparaci\u00F3n por algo significativo o reemplace la estructura.
comparing_literals_default_true=Est\u00E1s comparando dos valores que no cambian mientras se ejecuta tu programa. Tu bloque en forma de diamante siempre devolver\u00E1 [TRUE]. En consecuencia, tu c\u00F3digo entre corchetes horizontales %ALWAYSNEVER se ejecuta. Por lo tanto, el bloque es obsoleto.
comparing_literals_default_variable=Est\u00E1s comparando dos valores que no cambian mientras se ejecuta tu programa. Tu bloque en forma de diamante siempre devolver\u00E1 %TRUEFALSE%ADDINFODICT. En consecuencia, tu c\u00F3digo entre corchetes horizontales %ALWAYSNEVER se ejecuta. \u00BFPrefieres utilizar una variable %VARIABLE? Si es as\u00ED, debe ir a la paleta de variables y hacer una variable %VARIABLE primero. Luego, intente usar el nuevo bloque %VARIABLE en tu comparaci\u00F3n.
comparing_literals_default_variable_exists=Est\u00E1s comparando dos valores que no cambian mientras se ejecuta tu programa. Tu bloque en forma de diamante siempre devolver\u00E1 %TRUEFALSE%ADDINFODICT. En consecuencia, tu c\u00F3digo entre corchetes horizontales %ALWAYSNEVER se ejecuta. \u00BFPrefieres utilizar un bloque para tu variable definida %VARIABLE?
comparing_literals_default_variable_exists_two=Y como est\u00E1s comparando dos valores que no cambian mientras se ejecuta tu programa, la comparaci\u00F3n siempre resultar\u00E1 en %TRUEFALSE%ADDINFODICT. En consecuencia, tu c\u00F3digo en el bloque [bc]%THENELSE[/bc] %ALWAYSNEVER se ejecutar\u00E1. \u00BFPrefieres utilizar una variable [var]%VARIABLE1[/var] o una variable [var]%VARIABLE2[/var] o ambas? Si es as\u00ED, debe ir a la caja de herramientas de variables y usar el bloque [var]%VARIABLE1[/var] y/o [var]%VARIABLE2[/var] en tu comparaci\u00F3n.
comparing_literals_default_variable_exists_two_without_information=Y como est\u00E1s comparando dos valores que no cambian mientras se ejecuta tu programa, la comparaci\u00F3n siempre resultar\u00E1 en %TRUEFALSE%ADDINFODICT. \u00BFPrefieres utilizar una variable [var]%VARIABLE1[/var] o una variable [var]%VARIABLE2[/var] o ambas? Si es as\u00ED, debe ir a la caja de herramientas de variables y usar el bloque [var]%VARIABLE1[/var] y/o [var]%VARIABLE2[/var] en tu comparaci\u00F3n.
comparing_literals_default_variable_exists_without_information=Y como est\u00E1s comparando dos valores que no cambian mientras se ejecuta tu programa, la comparaci\u00F3n siempre resultar\u00E1 en %TRUEFALSE%ADDINFODICT. \u00BFPrefieres utilizar un bloque para tu variable definida [var]%VARIABLE[/var]?
comparing_literals_default_variable_two=Y como est\u00E1s comparando dos valores que no cambian mientras se ejecuta tu programa, la comparaci\u00F3n siempre resultar\u00E1 en %TRUEFALSE%ADDINFODICT. En consecuencia, tu c\u00F3digo en el bloque [bc]%THENELSE[/bc] %ALWAYSNEVER se ejecutar\u00E1. \u00BFPrefieres utilizar una variable [var]%VARIABLE1[/var] o una variable [var]%VARIABLE2[/var] o ambas? Si es as\u00ED, tienes que ir a la caja de herramientas de variables y hacer una variable [var]%VARIABLE1[/var] o una variable [var]%VARIABLE2[/var] o ambas primero. Luego intenta usar el nuevo bloque [var]%VARIABLE1[/var] y/o [var]%VARIABLE2[/var] en tu comparaci\u00F3n.
comparing_literals_default_variable_two_without_information=Y como est\u00E1s comparando dos valores que no cambian mientras se ejecuta tu programa, la comparaci\u00F3n siempre resultar\u00E1 en %TRUEFALSE%ADDINFODICT. \u00BFPrefieres utilizar una variable [var]%VARIABLE1[/var] o una variable [var]%VARIABLE2[/var] o ambas? Si es as\u00ED, tienes que ir a la caja de herramientas de variables y hacer una variable [var]%VARIABLE1[/var] o una variable [var]%VARIABLE2[/var] o ambas primero. Luego intenta usar el nuevo bloque [var]%VARIABLE1[/var] y/o [var]%VARIABLE2[/var] en tu comparaci\u00F3n.
comparing_literals_default_variable_without_information=Est\u00E1s comparando dos valores que no cambian mientras se ejecuta tu programa. La comparaci\u00F3n siempre resultar\u00E1 en %TRUEFALSE%ADDINFODICT. \u00BFPrefieres utilizar una variable [var]%VARIABLE[/var]? Si es as\u00ED, debes ir a la caja de herramientas de variables y hacer una variable [var]%VARIABLE[/var] primero. Luego intenta usar el nuevo bloque [var]%VARIABLE[/var] en tu comparaci\u00F3n.
comparing_literals_default_without_information=Est\u00E1s comparando dos textos cuyos valores que no cambian durante la ejecuci\u00F3n de tu programa. La comparaci\u00F3n siempre resultar\u00E1 en %TRUEFALSE%ADDINFODICT. Cambia la comparaci\u00F3n por algo significativo o modifica la estructura.
comparing_literals_wait_false=Est\u00E1s comparando dos valores que no cambian mientras se ejecuta tu programa. Tu bloque en forma de diamante siempre devolver\u00E1 FALSE. Los bloques despu\u00E9s del bloque Wait se ejecutar\u00E1n %ALWAYSNEVER. Cambia la comparaci\u00F3n por algo significativo o reemplaza la estructura.
comparing_literals_wait_true=Est\u00E1s comparando dos valores que no cambian mientras se ejecuta tu programa. Tu bloque en forma de diamante siempre devolver\u00E1 VERDADERO. Los bloques despu\u00E9s de Wait se ejecutar\u00E1n %ALWAYSNEVER. Por lo tanto, el bloque es obsoleto.
comparing_literals_wait_variable=Est\u00E1s comparando dos valores que no cambian mientras se ejecuta tu programa. Tu bloque en forma de diamante siempre devolver\u00E1 %TRUEFALSE%ADDINFODICT. En consecuencia, los bloques despu\u00E9s del bloque Wait se ejecutar\u00E1n %ALWAYSNEVER. \u00BFPrefieres utilizar una variable %VARIABLE? Si es as\u00ED, debes ir a la paleta de variables y hacer una variable %VARIABLE primero. Luego, intenta usar el nuevo bloque %VARIABLE en tu comparaci\u00F3n.
comparing_literals_wait_variable_exists=Est\u00E1s comparando dos valores que no cambian mientras se ejecuta tu programa. Tu bloque en forma de diamante siempre devolver\u00E1 %TRUEFALSE%ADDINFODICT. En consecuencia, los bloques despu\u00E9s del bloque Wait se ejecutar\u00E1n %ALWAYSNEVER. \u00BFPrefieres utilizar un bloque para tu variable definida %VARIABLE?
comparing_literals_wait_variable_exists_two=Y como est\u00E1s comparando dos valores que no cambian mientras se ejecuta tu programa, la comparaci\u00F3n siempre resultar\u00E1 en %TRUEFALSE%ADDINFODICT. En consecuencia, tu c\u00F3digo despu\u00E9s del [sbi]espera hasta que el bloque < >[/sbi] %ALWAYSNEVER se ejecutar\u00E1. \u00BFPrefieres utilizar la variable [var]%VARIABLE1[/var] o la variable [var]%VARIABLE2[/var] o ambas? Si es as\u00ED, debes ir a la caja de herramientas de variables y usar el bloque [var]%VARIABLE1[/var] y/o [var]%VARIABLE2[/var] en tu comparaci\u00F3n.
comparing_literals_wait_variable_two=Y como est\u00E1s comparando dos valores que no cambian mientras se ejecuta tu programa, la comparaci\u00F3n siempre resultar\u00E1 en %TRUEFALSE%ADDINFODICT. En consecuencia, tu c\u00F3digo despu\u00E9s de [sbi]espere hasta que <>[/sbi] %ALWAYSNEVER se ejecutar\u00E1. \u00BFPrefieres utilizar una variable [var]%VARIABLE1[/var] o una variable [var]%VARIABLE2[/var] o ambas? Si es as\u00ED, tienes que ir a la caja de herramientas de variables y hacer una variable [var]%VARIABLE1[/var] o una variable [var]%VARIABLE2[/var] o ambas primero. Luego intenta usar el nuevo bloque [var]%VARIABLE1[/var] y/o [var]%VARIABLE2[/var] en tu comparaci\u00F3n.
conditional_inside_loop=Very good! You continouosly check for conditions within a loop. You know how to combine important control blocks and that can help you solve more advanced problems.
controlled_broadcast_or_stop=Very good! To have more control over your program, you continouosly check for certain conditions before broadcasting or stopping the program/script.
coordination=Awesome! You can coordinate your scripts within the program very well! That is essential for larger programs.
correct_broadcast=Great job! You correctly implemented a broadcast, now you can easily coordinate all your scripts.
custom_block_usage=Very good! You know how to create your own block and also how to use it in you program.
custom_block_with_forever=Si un bloque propio contiene un bucle infinito y el bloque propio se usa en medio de otro script, el script nunca podr\u00E1 finalizar. Un bloque forever en el bloque propio hace que el script que le llam\u00F3 nunca pueda continuar.
custom_block_with_termination=The custom block [sbi]%METHOD[/sbi] contains a [sbi]stop [all v][/sbi] or [sbi]delete this clone[/sbi] and the custom block is called in the middle of another script, the script will never reach the blocks following the call of [sbi]%METHOD[/sbi]. Delete the [sbi]stop [all v][/sbi] or [sbi]delete this clone[/sbi] in the custom block [sbi]%METHOD[/sbi] or use an [sbi]if < > then[/sbi] block to not stop in every execution.
dead_code=Tu proyecto contiene bloques inaccesibles. Eso significa que hay bloques que nunca se ejecutar\u00E1n. Esto hace que el proyecto est\u00E9 desordenado. Puedes borrar estos bloques.
delete_clone_in_loop=Your code is deleting the clone in the first iteration of the loop. This makes the loop unnecessary and it just makes your program harder to read. You can remove the loop.
directed_motion=Super! Triggered by a keystroke your sprite can move directed. That is an important concept for most computer games.
double_if=Tu proyecto contiene una condici\u00F3n [sbi]si < > entonces[/sbi] duplicada. Esto hace que el proyecto est\u00E9 desordenado. Puedes acortar el programa fusionando las dos sentencias [sbi]si < > entonces[/sbi] en una \u00FAnica sentencia condicional.
duplicate_sprite=Tu proyecto contiene varias copias exactas del mismo Sprite. Esto hace que el proyecto est\u00E9 desordenado. Considera usar la clonaci\u00F3n en su lugar.
duplicated_script=Tu proyecto contiene un script id\u00E9ntico dos veces. Probablemente solo necesite uno de ellos y podr\u00EDas eliminar la copia.
duplicated_scripts_covering=Your project contains the identical script twice. The scripts overlap exactly so you may be not aware of this. You probably only need one of them, and could delete all copies.
empty_control_body=Los corchetes horizontales de [sbi]%BLOCKNAME[/sbi] est\u00E1n vac\u00EDos, por lo que cuando se invoca el bloque de control no sucede nada. Esto hace que tu c\u00F3digo sea m\u00E1s dif\u00EDcil de entender. Considera eliminar este bloque si no lo necesitas.
empty_custom_block=Creaste un bloque propio que no contiene instrucciones. Cuando se invoca este bloque propio, no sucede nada. Considera eliminarlo si no lo necesitas.
empty_project=Tu proyecto est\u00E1 completamente vac\u00EDo. Empieza agregando el primer sprite.
empty_script=Utilizas un bloque de eventos vac\u00EDo, por lo que cuando ocurra el evento, no pasar\u00E1 nada. Elimina este bloque de eventos o agrega bloques despu\u00E9s del mismo.
empty_sprite=El sprite %SPRITE no contiene bloques. No puede reaccionar a ninguna entrada de usuario o interacci\u00F3n con sprites. Si la intenci\u00F3n es esa, d\u00E9jalo como est\u00E1. De lo contrario, debes pensar en lo que deber\u00EDa hacer el objeto e introducir scripts en este objeto.
endless_recursion_broadcast=Si un bloque propio se llama a s\u00ED mismo dentro de su cuerpo y no tiene ninguna condici\u00F3n para detener la recursividad, se ejecutar\u00E1 para siempre.
endless_recursion_procedure=Si se env\u00EDa un mensaje en el mismo script en el que se recibi\u00F3 y el script no tiene ninguna condici\u00F3n para detener la recursividad, se ejecutar\u00E1 para siempre.
expression_as_touching_or_color=Este bloque espera un color o un sprite como par\u00E1metro y no funciona correctamente con una cadena o un n\u00FAmero.
forever_inside_if=The loop [sbi]forever[/sbi] is never left. All blocks inside this script but outside of the forever loop, this includes the blocks following the [sbi]if < > then[/sbi], are never executed. Try omitting the inner loop.
forever_inside_loop=Si dos bucles est\u00E1n anidados y el bucle interno es un bucle infinito, el bucle interno nunca terminar\u00E1. Por lo tanto, las instrucciones despu\u00E9s del bucle interno no se ejecutar\u00E1n nunca.
gliding_motion=Super! Triggered by a keystroke your sprite can make a gliding motion. That is an important concept for most computer games.
hide_without_show=Your program uses a [sbi]hide[/sbi] block without making the sprite visible ever again. This leads to changes to the sprite not being visualised. To make these changes visible you have to use a [sbi]show[/sbi] block in your program.
illegal_parameter_refactor=El par\u00E1metro tiene un tipo incorrecto. Al editar el bloque propio, el par\u00E1metro booleano se ha convirtido en un par\u00E1metro num\u00E9rico o de texto. Para arreglar esto, deshaz la edici\u00F3n.
immediate_delete_clone_after_broadcast=El script elimina el clon inmediatamente despu\u00E9s del bloque [sbi]enviar (%MESSAGE v)[/sbi]. El script que maneja el mensaje para este clon no se ejecutar\u00E1 correctamente. En su lugar, es mejor usar un bloque de [sbi]enviar (%MESSAGE v) y esperar[/sbi].
immediate_stop_after_say_think=El script detiene todo inmediatamente despu\u00E9s del bloque [bc]%SAYTHINK[/bc]. El texto nunca se llegar\u00E1 a mostrar. Reemplaza el bloque [bc]%SAYTHINK[/bc] por un bloque [sbi]%SAYTHINK durante ( ) segundos[/sbi]. To make the rest of the program stop you can insert a [sbi]stop [other scripts in sprite v][/sbi] before the %SAYTHINK.
immediate_stop_after_say_think_multiple=El script detiene todo inmediatamente despu\u00E9s del bloque [bc]%SAYTHINK[/bc]. El texto nunca se llegar\u00E1 a mostrar. Reemplaza el bloque [bc]%SAYTHINK[/bc] por un bloque [sbi]%SAYTHINK durante ( ) segundos[/sbi]. To make the rest of the program stop you can insert a [sbi]stop [other scripts in sprite v][/sbi] before the %SAYTHINK. If you want to stop everything while the sprite is executing the [sbi]%SAYTHINK ( ) for ( ) seconds[/sbi] block, you have to inform other sprites using a [sbi]broadcast (message v)[/sbi] block, so that they can stop their scripts.
inappropriate_handler_delete_clone=El script contiene un bloque de [sbi]eliminar este clon[/sbi]. Sin embargo,no se puede ejecutar porque en el controlador de eventos no Est\u00E1s claro a qu\u00E9 clon te refieres. El script tiene que comenzar con un [sbi]al comenzar como clon[/sbi] o un [sbi]al hacer clic en este objeto[/sbi]. Otra posibilidad ser\u00EDa mover el bloque [sbi]eliminar este clon[/sbi] a un script que comience con uno de estos bloques.
initialisation_of_looks_sprite=Super! You initialize the looks of your sprite with every new program start.
initialisation_of_looks_stage=Super! You initialize the looks of your stage with every new program start.
initialisation_of_position=Great job! You initialize the location of your sprite with every new program start.
interrupted_loop_sensing=El bloque [bc]%BLOCKNAME[/bc] interrumpe la comprobaci\u00F3n de la condici\u00F3n del bloque [bc]%THENELSE[/bc] mientras se ejecuta. Puede suceder que se produzca la condici\u00F3n, pero tu script no reacciona en consecuencia porque Est\u00E1s ocupado haciendo el bloque [bc]%BLOCKNAME[/bc]. Considera realizar la verificaci\u00F3n de la condici\u00F3n en un script separado (paralelo).
key_set_position=Your program sets the position of the sprite everytime you press %KEY to a specific value. You probably wanted to move the sprite by a certain value. For this you have to use the block [sbi]change %XY by ( )[/sbi].
list_usage=Well done! You can use a list and therefore handle important concepts of collections in programming.
long_script=El script que has creado es muy largo. Div\u00EDdelo en dos o m\u00E1s scripts m\u00E1s peque\u00F1os para mantener la perspectiva de lo que est\u00E1s haciendo.
loop_one=Si establece el n\u00FAmero de repeticiones de un bucle en 1, se ejecutar\u00E1 una sola vez. En ese caso, se podr\u00EDa eliminar el bloque de bucle y simplemente conectar los bloques que contiene.
loop_sensing=Very good! To ensure that you don\u00B4t miss an event you continuously check for it in a forever loop.
loop_zero=Si estableces el n\u00FAmero de repeticiones de un bucle en 0, nunca se ejecutar\u00E1. En ese caso, se podr\u00EDa quitar el bloque de bucle y los bloques que contiene.
matching_parameter=You know that a parameter should to be initialized before used.
message_naming=El mensaje [bc]%MESSAGE[/bc] no tiene un nombre con sentido. Est\u00E1s utilizando el nombre por defecto o uno que ya est\u00E1 en uso seguido por un n\u00FAmero. Esto hace que tu programa sea dif\u00EDcil de comprender. Utiliza un mensaje con sentido y \u00FAnico.
message_never_received=El mensaje %MESSAGE enviado por esta transmisi\u00F3n nunca es recibido por ning\u00FAn bloque [sbi]al recibir [ v][/sbi]. De modo que no ocurrir\u00E1 nada como reacci\u00F3n al mensaje. Cuando un script env\u00EDa un mensaje, hay que comprobar que lo reciba otro script.
message_never_sent=El mensaje %MESSAGE que debe recibir este bloque nunca se env\u00EDa. Por tanto, este script nunca se activar\u00E1. Cuando un script espera recibir un mensaje, hay que comprobar que otro script se lo env\u00EDe.
message_never_sent_say_think=El mensaje [bc]%MESSAGE[/bc] que deber\u00EDa recibir este bloque nunca se env\u00EDa. Este script nunca se activar\u00E1. Est\u00E1s utilizando el mensaje como texto en un bloque [sbi]%SAYTHINK durante ( ) segundos[/sbi] para el/los sprite(s): %SPRITE. Piensa si quieres enviar un mensaje [sbi]enviar [%MESSAGE v][/sbi] para avisarles.
message_never_sent_touching=El mensaje [bc]%MESSAGE[/bc] que deber\u00EDa recibir este bloque nunca se env\u00EDa. Este script nunca se activar\u00E1. Est\u00E1s utilizando un bloque [sbi]tocando (%SPRITE v)?[/sbi] en %SPRITE. Si quieres enviar un mensaje sobre el evento de haberse tocado a todos los sprites, debes usar un bloque de transmisi\u00F3n [sbi]enviar (%MESSAGE v)[/sbi].
middle_man_broadcast=Usar un receptor de transmisi\u00F3n solo para enviar una transmisi\u00F3n nuevamente se considera un mal olor en el c\u00F3digo, ya que el script es un intermediario entre el remitente original y el receptor final. Considera cambiar el c\u00F3dig para que el mensaje llegue al receptor final en la primera transmisi\u00F3n, y luego elimina el intermediario para que no haya c\u00F3digo redundante.
middle_man_procedure=El uso de un bloque propio solo para llamar a otro bloque propio se considera un mal olor en el c\u00F3digo, ya que el primer bloque propio es un intermediario. Considera cambiar la llamada al primer bloque propio convirti\u00E9ndola en una llamada al bloque propio final, y luego elimina el intermediario para que no haya c\u00F3digo redundante.
missing_ask=Tu proyecto usa el bloque [sbi]respuesta[/sbi], pero el bloque [sbi]preguntar () y esperar[/sbi] nunca se usa en el proyecto. El bloque [sbi]respuesta[/sbi] no puede devolver un valor con sentido. Utiliza el bloque [sbi]preguntar () y esperar[/sbi] antes de la primera instancia de [sbi]respuesta[/sbi].
missing_backdrop_switch=Si el bloque [sbi]Cuando el fondo cambie a [ v][/sbi] se usa para iniciar un script y el fondo nunca cambia al fondo seleccionado, el script nunca se ejecuta. Aseg\u00FArate de cambiar el fondo de tu proyecto.
missing_clone_call=Si el bloque [sbi]al comenzar como clon[/sbi] se usa para iniciar un script, pero el sprite nunca se clona, el evento nunca se activar\u00E1 y el script no se ejecutar\u00E1. Aseg\u00FArate de usar un bloque de clonaci\u00F3n.
missing_clone_initialization=Cuando se clona un objeto, pero este no tiene secuencias de comandos iniciadas por los eventos [sbi]al comenzar como clon[/sbi] o [sbi]al hacer clic en este objeto[/sbi], los clones no realizar\u00E1n ninguna acci\u00F3n. Quiz\u00E1s quieras usar un controlador de eventos en tu proyecto. De lo contrario, puedes usar el bloque [sbi]sellar[/sbi] en la extensi\u00F3n del l\u00E1piz si el clon solo debe ser visible.
missing_clone_initialization_delete_clone=Cuando un sprite es clonado pero no tiene scripts iniciados por [sbi]al comenzar como clon[/sbi] o [sbi]al hacer clic en este objeto[/sbi], los clones no realizar\u00E1n ninguna acci\u00F3n. Quiz\u00E1s quieras utilizar uno de estos dos controladores de eventos en tu proyecto. Adem\u00E1s, est\u00E1s utilizando un [sbi]eliminar este clon[/sbi] en un script de %SPRITE. Considera iniciar este script con un [sbi]al comenzar como clon[/sbi] o [sbi]al hacer clic en este objeto[/sbi].
missing_clone_initialization_delete_clone_message=Cuando un sprite es clonado pero no tiene scripts iniciados por [sbi]al comenzar como clon[/sbi] o [sbi]al hacer clic en este objeto[/sbi], los clones no realizar\u00E1n ninguna acci\u00F3n. Quiz\u00E1s quieras utilizar uno de estos dos controladores de eventos en tu proyecto. Adem\u00E1s, est\u00E1s utilizando un [sbi]eliminar este clon[/sbi] en un script de %SPRITE que comienza con el mensaje [bc]%MESSAGE[/bc]. Busca en el sprite %SPRITE el script que env\u00EDa el mensaje [bc]%MESSAGE[/bc]. Considera comenzar ese script con un [sbi]al comenzar como clon[/sbi] o [sbi]al hacer clic en este objeto[/sbi] en lugar de con un bloque [bc]%EVENTHANDLER[/bc].
missing_clone_initialization_delete_clone_message_multiple=Cuando un sprite es clonado pero no tiene scripts iniciados por [sbi]Cuando comienzo como un clon[/sbi] o [sbi]Cuando este sprite hace clic en los eventos[/sbi], los clones no realizar\u00E1n ninguna acci\u00F3n. Quiz\u00E1s quieras utilizar uno de estos dos controladores de eventos en tu proyecto. Adem\u00E1s, est\u00E1s utilizando un [sbi]eliminar este clon[/sbi] en un script de %SPRITE que comienza con el mensaje [bc]%MESSAGE[/bc]. Busca en el sprite %SPRITE los scripts que env\u00EDan el mensaje [bc]%MESSAGE[/bc]. Considera comenzar esos scripts con un [sbi]al comenzar como clon[/sbi] o [sbi]al hacer clic en este objeto[/sbi] en lugar de con bloques [bc]%EVENTHANDLER[/bc].
missing_erase_all=Si un objeto usa un bloque de l\u00E1piz hacia abajo pero nunca un bloque para borrar todo, todos los dibujos de una ejecuci\u00F3n anterior permanecen para la siguiente ejecuci\u00F3n. Tal vez deber\u00EDas usar un bloque [sbi]detener [todos][/sbi] despu\u00E9s de tu bloque de inicio.
missing_initialization=En este sprite, %VARIABLE no se inicializa antes de ser utilizado por primera vez. Utilizar\u00E1 cualquier valor que contenga al final de la \u00FAltima ejecuci\u00F3n, lo que puede que no sea lo que quieras.
missing_initialization_clone=En este sprite, %VARIABLE no se inicializa antes de ser utilizado por primera vez. Lo que puede que no sea lo que quieras.
missing_loop_mouse_position_direction=Your code attempts to turn the sprite to the mouse pointer, but only does this once. You might want to do this continuously for the entire duration while the project is running. For this you have to continuously execute the direction change and not just once. You have to wrap the direction block into a [sbi]forever[/sbi] block for this continuous change.
missing_loop_mouse_position_motion=Your code attempts to move the sprite towards the mouse position, but only does this once. You might want to do this continuously for the entire duration while the project is running. For this you have to continuously execute the movement and not just once. You have to wrap the motion block into a [sbi]forever[/sbi] block for this continuous movement.
missing_loop_sensing=Tu script ha de ejecutar acciones cuando ocurra un evento. Para ello, el script ha de estar continuamente verificando si el evento ha sucedido para no perd\u00E9rselo.
missing_loop_sensing_variable=Si est\u00E1s esperando a que una variable tenga un valor espec\u00EDfico, tienes que verificar ese evento continuamente dentro de un bucle, porque si no, no te enterar\u00E1s del evento. Utiliza un bloque de repetici\u00F3n.
missing_pen_down=Usas el bloque [sbi]bajar l\u00E1piz[/sbi] pero nunca vuelves a levantar el l\u00E1piz, por lo que tu sprite dibujar\u00E1 para siempre. Aseg\u00FArate de usar un bloque de [sbi]subir l\u00E1piz[/sbi] en el sprite.
missing_pen_up=Usas el bloque [sbi]subir l\u00E1piz[/sbi] pero tu sprite nunca ha bajado el bol\u00EDgrafo antes. Aseg\u00FArate de usar un bloque de [sbi]bajar l\u00E1piz[/sbi] si quieres dibujar algo.
missing_resource=A tu programa le falta el sonido o la imagen que est\u00E1s intentando utilizar. Seleccione otro sonido o imagen o agrega la que desees usar.
missing_termination=El bloque [sbi]repetir hasta que < >[/sbi] requiere una condici\u00F3n de parada. Si falta esa condici\u00F3n, el resultado es un bucle infinito. Si tienes  un bucle infinito no se ejecutar\u00E1n los bloques posteriores.
missing_wait_condition=El bloque [sbi]espera hasta que < >[/sbi] requiere una condici\u00F3n. Si falta esa condici\u00F3n, el bloque esperar\u00E1 eternamente y el c\u00F3digo que lo sigue nunca se ejecutar\u00E1.
mouse_follower=Very nice! Your sprite can follow the mouse. That can be a nice concept for lots of games.
movement_in_loop=Well done! The movements of your sprites are very fluent and natural because you implemented the moves in a loop.
multiple_attribute_modifications=Hay varios cambios de la misma variable o atributo uno detr\u00E1s de otro, que podr\u00EDan ser reemplazados por una \u00FAnica instrucci\u00F3n.
multiple_attribute_modifications_custom=Hay varios cambios de %VARIABLE uno detr\u00E1s de otro, que podr\u00EDan ser reemplazados por una \u00FAnica instrucci\u00F3n.
multiple_attribute_modifications_saythink=There are multiple [sbi]say ( )[/sbi] or [sbi]think ( )[/sbi] blocks in a row without delay. You will only see the first message if you use a [sbi]say ( ) for ( ) seconds[/sbi] or [sbi]think ( ) for ( ) seconds[/sbi] block.
nested_conditional_checks=Very good! You use nested conditions, such as nested [sbi]if < > then[/sbi] blocks. That can help you solve more advanced problems.
nested_loops=Si se anidan dos o m\u00E1s bucles, a menudo se producen problemas impredecibles. Evita hacerlo.
nested_loops_perfume=Good! You used nested loops such as nested [sbi]forever[/sbi] and [sbi]repeat ( )[/sbi] blocks. That can help you solve more advanced problems.
no_working_scripts=Tu sprite solo tiene bloques de sombrero (de inicio) sueltos y otros bloques muertos. Aseg\u00FArate de conectar los bloques de sombrero a los otros bloques para que el objeto pueda reaccionar a los eventos.
object_follower=Very nice! Your sprite can follow other objects. That can be a nice concept for lots of games.
orphaned_parameter=Si eliminas un par\u00E1metro de un bloque propio, aseg\u00FArate de eliminarlo de todas las ubicaciones donde lo usaste antes.
parallelisation=Well done! You start at least two scripts on the same event. Congratulations, you implemented the concept of parallelisation.
parameter_out_of_scope=Aseg\u00FArate de utilizar los par\u00E1metros de un bloque propio solo dentro de ese bloque.
position_equals_check=La posici\u00F3n de un objeto normalmente se define por su centro. Es poco probable que la coordenada %COORDINATE de un objeto tenga el valor exacto en una comparaci\u00F3n. En su lugar, intenta utilizar una aproximaci\u00F3n con [LEQ] o [GEQ].
position_equals_check_dist=La posici\u00F3n de un objeto normalmente se define por su centro. Es poco probable que la distancia entre dos objetos tenga el valor exacto en una comparaci\u00F3n. En su lugar, intenta utilizar una aproximaci\u00F3n con [LEQ] o [GEQ].
position_equals_check_zero_mouse=La distancia entre un sprite y el puntero del rat\u00F3n generalmente se mide de centro a centro. Es poco probable que los puntos centrales del puntero del rat\u00F3n y el sprite est\u00E9n exactamente uno encima del otro. Por eso, elimine la igualdad [EQ] y en su lubar usa una aproximaci\u00F3n con [LEQ] o usa el bloque en forma de diamante [sbi]\u00BFtocando ( v)?[/sbi].
position_equals_check_zero_sprites=La distancia entre dos sprites generalmente se mide de centro a centro. Es muy poco probable que los centros de dos sprites est\u00E9n exactamente uno encima del otro. Modifica la igualdad [EQ] y en su lugar usa una aproximaci\u00F3n con [LEQ] o usa el bloque en forma de diamante [sbi]\u00BFtocando ( v)?[/sbi].
recursive_cloning=Los scripts que comienzan con [sbi]al comenzar como clon[/sbi] no deber\u00EDan crear clones de s\u00ED mismos. Esto podr\u00EDa resultar en un n\u00FAmero infinito de clones.
same_variable_different_sprite=El mismo nombre de variable se usa en m\u00FAltiples sprites. Esto puede resultar confuso. Aseg\u00FArate de utilizar nombres \u00FAnicos para tus variables.
say_sound_synchronisation=Super! To make your sprite talk, you play a sound at the same time a speech bubble appears. That is a great feature for games.
sequential_actions=Tu programa contiene una secuencia de instrucciones similares repetidas que probablemente puedan acortarse mediante un bucle.
sprite_naming=El sprite %SPRITE no tiene un nombre significativo, ya que utiliza el nombre predeterminado o uno que ya se utiliza seguido de un n\u00FAmero. Esto hace que tu programa sea dif\u00EDcil de entender. Dale al sprite un nombre significativo y \u00FAnico.
sprite_naming_default=The sprite %SPRITE doesn't have a meaningful name but uses the default name. This makes your program harder to understand. Give your sprite a meaningful, unique name.
stuttering_movement=Cuando usas el evento [sbi]al presionar tecla [ v][/sbi] para el movimiento, esto podr\u00EDa resultar en un movimiento entrecortado. En este caso, es mejor usar un bucle [sbi]por siempre[/sbi] que maneje los eventos de pulsaci\u00F3n de teclas.
terminated_loop=El bucle finaliza antes de que realmente se repita (por ejemplo, mediante un bloque de parada).
timer=Very good! You use a variable as a sort of timer in your loop. You have a good understanding for loops and the utilization of them.
type_error=Algunas de las comparaciones comparan atributos de diferentes tipos.
type_error_weird_distance=Est\u00E1s utilizando un bloque de [sbi]distancia a (v)[/sbi] en una situaci\u00F3n donde no puedes medir la distancia. Usa el puntero del rat\u00F3n o las opciones de nombre de sprite que te da la distancia [sbi]distancia a ( v)[/sbi].
unnecessary_boolean_true=You are comparing a boolean sensing block with the value %VALUE. You could just use the sensing block directly without comparison.
unnecessary_boolean_false=You are comparing a boolean sensing block with the value %VALUE. You could just use the sensing block directly without comparison inside a [sbi]not < >[/sbi] block.
unnecessary_glide=You are using a [sbi]glide ( ) secs. to ( v))[/sbi] block. Since the time value is 0 this block is executed immediately. You can use a [sbi]go to ( v))[/sbi] block instead.
unnecessary_glide_xy=You are using a [sbi]glide ( ) secs. to x: ( ) y: ( ))[/sbi] block. Since the time value is 0 this block is executed immediately. You can use a [sbi]go to x: ( ) y: ( )[/sbi] block instead.
unnecessary_if=You are using two [sbi]if < > then[/sbi] blocks after another with the same combination of blocks inside. You can make that easier to read by using an [sbi]<< > or < >>[/sbi] block combining the conditions in a single [sbi]if < > then[/sbi] block.
unnecessary_if_after_until=Est\u00E1s utilizando un bloque [sbi]si < >, entonces[/sbi] despu\u00E9s de un bloque [sbi]repetir hasta que < >[/sbi] con la misma condici\u00F3n. Los bloques dentro del [sbi]si < >, entonces[/sbi] se ejecutar\u00E1n siempre. Puedes, por tanto, borrar el bloque [sbi]si < >, entonces[/sbi].
unnecessary_if_after_until_else=Est\u00E1s utilizando un bloque [sbi]si < >, entonces si no[/sbi] despu\u00E9s de un bloque [sbi]repetir hasta que < >[/sbi] con la misma condici\u00F3n. Los bloques dentro del [sbi]si < >, entonces si no[/sbi] se ejecutar\u00E1n siempre. Puedes, por tanto, borrar el bloque [sbi]si < >, entonces si no[/sbi].
unnecessary_message=You are using a [sbi]broadcast (%MESSAGE v)[/sbi] block immediately after the event handler block. You could simply use the same event handler on the scripts starting with [sbi]when I receive [%MESSAGE v][/sbi].
unnecessary_move=You are using a move block that does not change the position of the sprite. You can remove the block.
unnecessary_rotation=You are using a turn that does not change the orientation of the sprite. You can just remove the turn block.
unnecessary_say=You are using a [sbi]say ( ) for ( ) seconds[/sbi] block. Since the time value is 0 this block has no effect. You can delete it.
unnecessary_size_change=You are using a block that does not change the size of the sprite. You can just remove the turn block.
unnecessary_stop_script=There is a [sbi]stop [this script v][/sbi] block at the end of a script. You can delete it.
unnecessary_think=You are using a [sbi]think ( ) for ( ) seconds[/sbi] block. Since the time value is 0 this block has no effect. You can delete it.
unnecessary_wait=You are using a [sbi]wait ( ) seconds[/sbi] block. Since the value is 0 this block has no effect. You can delete it.
unused_custom_block=Has creado un bloque propio pero nunca lo usas en tu proyecto. Esto hace que el proyecto est\u00E9 desordenado. Elimina el bloque propio.
unused_parameter=Has creado un par\u00E1metro pero nunca lo usas en tu procedimiento. Esto hace que el bloque propio sea m\u00E1s dif\u00EDcil de entender. Elimina el par\u00E1metro.
unused_variables=Has creado una variable [var]%VARIABLE[/var] pero nunca la usas en tu proyecto. Esto hace que el proyecto sea m\u00E1s dif\u00EDcil de entender. Borra la variable [var]%VARIABLE[/var] o usa los bloques [sbi]dar a [%VARIABLE v] el valor ( )[/sbi], [sbi]sumar a [%VARIABLE v] ( )[/sbi] en tu proyecto.
unused_variables_list=Has creado una variable de tipo lista [var]%VARIABLE[/var], pero nunca la utilizas en tu proyecto. Esto hace que tu c\u00F3digo sea m\u00E1s dif\u00EDcil de entender. Borra la variable de tipo lista [var]%VARIABLE[/var] o usa los bloques [sbi]sumar a [%VARIABLE v] ( )[/sbi], [sbi]dar a [%VARIABLE v] el valor ( )[/sbi] en tu proyecto.
useful_position_check=Well done! In Scratch the values for x- and y- coordinates are very exact floating point values. An [EQ] check with these numbers can cause problems. To avoid that, you used [LEQ] or [GEQ] operators.
useless_blocks_sprite=You used a block that is not intended for sprites. It only shows effect when used inside the stage. You can remove it.
useless_blocks_stage=You used a block that is not intended for the stage. It only shows effect when used inside sprites. You can remove it.
valid_termination=You implemented a valid termination condition in your loop, that prevents the loop to run forever.
variable_as_literal=Est\u00E1s usando el nombre de una variable como texto. \u00BFNo ser\u00E1 que lo que quieres hacer es utilizar el bloque  %VARIABLE en su lugar?
variable_initialization_race=Una variable se inicializa en diferentes scripts activados por el mismo evento. El resultado puede cambiar seg\u00FAn el orden en que se ejecuten los scripts. Intenta asignar los valores en solo uno de los scripts.
waiting_check_stop=Great! You are waiting for a condition to stop your program.
